import requests    
test_data = {
        "flag": 0, 
        "info": {
            '性别': "男",
            '年龄': 20,
            '身高': 175,
            '体重': 65.5,
            'activity_level': "b",
            '疾病情况': None
        },
        "data": {
            "餐别":"午餐",
            '菜品名称':[
                {
                   "食品名称":"番茄炒蛋",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"凉拌土豆丝",
                    "食品克数": "100",
                    "食材信息": {
                        "土豆":"100"
                        }
                },
                {
                   "食品名称":"尖椒土豆片",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"裙带菜豆腐汤",
                    "食品克数": "100",
                    "食材信息": {}
                },
                {
                   "食品名称":"白扁豆炒肉",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"葛根排骨汤",
                    "食品克数": "100",
                    "食材信息": {}
                },
                {
                   "食品名称":"红烧带鱼",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"卤蛋",
                    "食品克数": "50",
                    "食材信息": {
                        "鸡蛋":"50"
                        }
                },
                {
                   "食品名称":"牛肉炒木耳",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"素炒甘蓝丝",
                    "食品克数": "100",
                    "食材信息": {
                        "结球甘蓝":"100"
                        }
                },
                {
                   "食品名称":"尖椒炒肉",
                    "食品克数":"100",
                    "食材信息": {}
                },
                {
                   "食品名称":"蒸芋头",
                    "食品克数": "100",
                    "食材信息": {
                        "芋头":"100"
                        }
                },
                {
                   "食品名称":"猪肉白菜炖粉条",
                    "食品克数":"200",
                    "食材信息": {}
                },
                {
                   "食品名称":"煮鹅蛋",
                    "食品克数": "70",
                    "食材信息": {
                        "鹅蛋":"70"
                        }
                }
                
            
            ] 
        }
        }
ip_address = 'http://192.168.99.55'
port = '5000'
url = f"{ip_address}:{port}/recommend_dishes"
response = requests.post(url, json=test_data)

print()
# print("response",response.json())
